export const CATEGORY_GROUPS = {
    "属会 (Category A)": [
        "檳城南陽堂葉氏宗祠",
        "霹靂太平南陽堂葉氏宗祠",
        "隆雪南陽葉氏公會",
        "雪蘭莪沙登、無拉港南陽葉氏宗親會",
        "森州南陽葉氏宗親聯宗會",
        "波德申葉氏聯宗會",
        "馬六甲吳興南陽堂沈葉尤宗祠",
        "柔佛州葉氏宗親會",
        "柔南南陽葉氏宗親會",
        "沙巴州西海岸葉氏宗親會",
        "沙巴州山打根葉氏宗親會",
        "沙巴州斗湖葉氏宗親會",
        "砂拉越美里葉氏",
        "砂拉越詩巫省南陽葉氏宗親會",
        "砂拉越泗里街省葉氏公會",
        "砂拉越南陽葉氏宗親會",
        "雪州蒲種葉氏公會",
        "馬來西亞南陽葉氏宗親總會",
        "雪蘭莪沈氏宗祠",
        "吉隆玻沈氏宗祠",
        "馬來西亞尤氏宗親總會"
    ],
    "其他社团 (Category B)": [
        "雪隆惠州会馆",
        "沙叻秀惠州会馆",
        "史里肯邦安惠州会馆",
        "乌鲁雪兰莪惠州会馆",
        "吉隆坡廣東义山",
        "隆雪中華大會堂",
        "吉隆坡仙駟師爺廟",
        "雪隆嘉应会馆",
        "吉隆玻赤溪公馆",
        "雪隆广肇会馆",
        "雪隆陈氏书院宗親会"
    ],
    "其他 (Others)": [
        "主席桌 VIP 1",
        "主席桌 VIP 2",
        "理事",
        "婦女組",
        "青年團",
        "孝親敬老",
        "租戶",
        "記者",
        "邀请宗亲会社团",
        "会员席"
    ]
};

// Helper to flatten if needed
export const ALL_CATEGORIES = Object.values(CATEGORY_GROUPS).flat();
